---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Field.KeyType
source: html/f91e5361-f863-973e-5195-b4f775d708ee.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.KeyType Property

The type of the keys stored in the field.

## Syntax (C#)
```csharp
public Type KeyType { get; }
```

## Remarks
For key-value maps, this is the key type. For all other field, this is NULL.